jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
void mqtt_callback(char* topic, byte* payload, unsigned int length)
{
	Serial.print("Message arrived [");
	Serial.print(topic);
	Serial.print("]: ");
	for (int i = 0; i < length; i++)
	{
		char receivedChar = (char)payload[i];
		Serial.print(receivedChar);
		if (receivedChar == '0')
		{
			// ESP8266 Huzzah outputs are "reversed"
			//digitalWrite(ledPin, HIGH);
			Serial.print("turn off");
		}
		else if (receivedChar == '1')
		{
			//digitalWrite(ledPin, LOW);
			Serial.print("turn on");
		}
		else
		{
			Serial.print("unknown data: ");
			Serial.print(receivedChar);
		}
	}
	Serial.println();
}
#endif

// Telegram config
// Need token
const byte telegramUsersNumber = 10;
#ifdef TELEGRAM_ENABLE
//#include <WiFiClientSecure.h>
#include "CTBot.h"
CTBot myBot;
const int telegramMessageMaxSize = 300;
typedef struct telegramMessage
{
	byte retries;
	int64_t user;
	String message;
};

String telegramToken = "";
int64_t telegramUsers[telegramUsersNumber];
const byte telegramMessageBufferSize = 10;
telegramMessage telegramOutboundBuffer[telegramMessageBufferSize];
byte telegramOutboundBufferPos = 0;
int telegramMessageDelay = 2000;
byte telegramRetries = 3;
unsigned long telegramLastTime = 0;
bool telegramEnable = false;

String uint64ToString(uint64_t input)
{
	String result = "";
	uint8_t base = 10;
	do
	{
		char c = input % base;
		input /= base;
		if (c < 10) c += '0';
		else c += 'A' - 10;
		result = c + result;
	} while (input);
	return result;
}

uint64_t StringToUint64(String value)
{
	uint64_t result = 0;

	const char* p = value.c_str();
	const char* q = p + value.length();
	while (p < q)
	{
		result = (result << 1) + (result << 3) + *(p++) - '0';
	}
	return result;
}

bool sendToTelegramServer(int64_t user, String str)
{
	bool result = false;
	if (telegramEnable && WiFi.status() == WL_CONNECTED)
	{
		result = myBot.testConnection();
		if (result)
		{
			String tmpStr = "";
			tmpStr.reserve(str.length() * 3);
			tmpStr = str;
			tmpStr.replace(F("\r"), "");
			tmpStr.replace(F("\n"), F("%0a"));
			tmpStr.replace(F("\t"), F("%09"));
			tmpStr.replace(F(" "), F("%20"));
			tmpStr.replace(F("["), F("%5b"));
			tmpStr.replace(F("]"), F("%5d"));
			tmpStr.replace(F("?"), F("%3f"));
			tmpStr.replace(F("@"), F("%40"));
			tmpStr.replace(F("&"), F("%26"));
			tmpStr.replace(F("\\"), F("5c"));
			tmpStr.replace(F("/"), F("%2f"));
			Serial.print(F("Sending: "));
			Serial.println(tmpStr);
			result = myBot.sendMessage(user, tmpStr);
			if (!result) Serial.println(F("failed"));
			else
			{
				Serial.println(F("success"));
				result = true;
			}
		}
		else Serial.println(F("TELEGRAM connection error"));
	}
	else Serial.println(F("WiFi not connected"));
	return result;
}

void addMessageToTelegramOutboundBuffer(int64_t user, String message, byte retries)
{
	if (telegramOutboundBufferPos >= telegramMessageBufferSize)
	{
		for (int i = 0; i < telegramMessageBufferSize - 1; i++)
		{
			telegramOutboundBuffer[i] = telegramOutboundBuffer[i + 1];
		}
		telegramOutboundBufferPos = telegramMessageBufferSize - 1;
	}
	telegramOutboundBuffer[telegramOutboundBufferPos].user = user;
	telegramOutboundBuffer[telegramOutboundBufferPos].message = message;
	telegramOutboundBuffer[telegramOutboundBufferPos].retries = retries;
	telegramOutboundBufferPos++;
}

void removeMessageFromTelegramOutboundBuffer()
{
	if (telegramOutboundBufferPos <= 0) return;
	for (int i = 0; i < telegramOutboundBufferPos; i++)
	{
		if (i < telegramMessageBufferSize - 1) telegramOutboundBuffer[i] = telegramOutboundBuffer[i + 1];
		else
		{
			telegramOutboundBuffer[i].message = "";
			telegramOutboundBuffer[i].user = 0;
		}
	}
	telegramOutboundBufferPos--;
}

void sendToTelegram(int64_t user, String message, byte retries)
{
	// slice message to pieces
	while (message.length() > 0)
	{
		if (message.length() >= telegramMessageMaxSize)
		{
			addMessageToTelegramOutboundBuffer(user, message.substring(0, telegramMessageMaxSize), retries);
			message = message.substring(telegramMessageMaxSize);
		}
		else
		{
			addMessageToTelegramOutboundBuffer(user, message, retries);
			message = "";
		}
	}
}

void sendBufferToTelegram()
{
	if (telegramEnable && WiFi.status() == WL_CONNECTED && myBot.testConnection())
	{
		bool isRegisteredUser = false;
		bool isAdmin = false;
		TBMessage msg;
		while (myBot.getNewMessage(msg))
		{
			Serial.print(F("Received TELEGRAM message ["));
			Serial.print(msg.sender.username);
			Serial.print(F("]: "));
			Serial.println(msg.text);

			//assign 1st sender as admin if admin is empty
			if (telegramUsers[0] == 0)
			{
				telegramUsers[0] = msg.sender.id;
				Serial.print(F("admin set to ["));
				Serial.print(uint64ToString(telegramUsers[0]));
				Serial.println(F("]"));
			}

			//check if it's registered user
			for (int i = 0; i < telegramUsersNumber; i++)
			{
				if (telegramUsers[i] == msg.sender.id)
				{
					isRegisteredUser = true;
					if (i == 0) isAdmin = true;
					break;
				}
			}

			//process data from TELEGRAM
			if (isRegisteredUser && msg.text.length() > 0)
			{
				Serial.println(F("User is registered"));
				sendToTelegram(msg.sender.id, deviceName + ": " + msg.text, telegramRetries);
				String str = processCommand(msg.text, TELEGRAM_CHANNEL, isAdmin);
				Serial.print(F("Command answer: "));
				Serial.println(str);
				sendToTelegram(msg.sender.id, deviceName + ": " + str, telegramRetries);
			}
			yield();
		}

		if (telegramOutboundBuffer[0].message.length() != 0)
		{
			if (sendToTelegramServer(telegramOutboundBuffer[0].user, telegramOutboundBuffer[0].message))
			{
				removeMessageFromTelegramOutboundBuffer();
			}
			else
			{
				telegramOutboundBuffer[0].retries--;
				if (telegramOutboundBuffer[0].retries <= 0)
				{
					removeMessageFromTelegramOutboundBuffer();
				}
			}
		}
	}
}

String getTelegramUser(byte n)
{
	int singleUserLength = TELEGRAM_USERS_TABLE_size / telegramUsersNumber;
	String userStr = readConfigString((TELEGRAM_USERS_TABLE_addr + n * singleUserLength), singleUserLength);
	userStr.trim();
	return userStr;
}

#endif

