jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
/*
AM2320 I2C temperature + humidity sensor
PINS: D1 - SCL, D2 - SDA
pin 1 of the sensor to +3.3V/+5V
pin 2 of the sensor to SDA
pin 3 of the sensor to GND
pin 4 of the sensor to SCL
5-10K pullup resistor from pin 2 (SDA) to pin 1 (power) of the sensor
5-10K pullup resistor from pin 4 (SCL) to pin 1 (power) of the sensor
*/
#ifdef AMS2320_ENABLE
#include "Adafruit_Sensor.h"
#include "Adafruit_AM2320.h"
Adafruit_AM2320 am2320 = Adafruit_AM2320();
#endif

// HTU21D I2C temperature + humidity sensor
// PINS: D1 - SCL, D2 - SDA
#ifdef HTU21D_ENABLE
#include <Wire.h>
#include "Adafruit_HTU21DF.h"
Adafruit_HTU21DF htu21d = Adafruit_HTU21DF();
#endif

// BME280 I2C temperature + humidity + pressure sensor
// PINS: D1 - SCL, D2 - SDA
#ifdef BME280_ENABLE
#include "Adafruit_Sensor.h"
#include "Adafruit_BME280.h"
#define BME280_ADDRESS 0xF6
Adafruit_BME280 bme;
#endif

/*
DS18B20 OneWire temperature sensor
PINS: D4 - OneWire
pin 1 to +3.3V/+5V
pin 2 to whatever your OneWire is
pin 3 to GROUND
5-10K pullup resistor from pin 2 (data) to pin 1 (power) of the sensor
*/
#ifdef DS18B20_ENABLE
#include <OneWire.h>
#include "DallasTemperature.h"
#define ONE_WIRE_PIN 02 //D4
OneWire oneWire(ONE_WIRE_PIN);
DallasTemperature ds1820(&oneWire);
#endif

/*
DHT11/DHT21(AM2301)/DHT22(AM2302, AM2321) temperature + humidity sensor
PINS: D3 - DATA
pin 1 of the sensor to +3.3V/+5V
pin 2 of the sensor to whatever your DHTPIN is
pin 4 of the sensor to GROUND
5-10K pullup resistor from pin 2 (data) to pin 1 (power) of the sensor
*/
#ifdef DHT_ENABLE
#include "DHT.h"
#define DHTTYPE DHT11 //DHT11, DHT21, DHT22 
#define DHTPIN 0 //D3
DHT dht(DHTPIN, DHTTYPE);
#endif

// MH-Z19 CO2 sensor via UART
// PINS: D5 - TX, D6 - RX
#ifdef MH_Z19_UART_ENABLE
#include <SoftwareSerial.h>;
#define MHZ19_TX 14 //D5
#define MHZ19_RX 12 //D6
SoftwareSerial co2sensor(MHZ19_TX, MHZ19_RX, false, 32);
unsigned int co2_uart_avg[3] = { 0, 0, 0 };
int mhtemp_s = 0;

int co2SerialRead()
{
	byte cmd[9] = { 0xFF, 0x01, 0x86, 0x00, 0x00, 0x00, 0x00, 0x00, 0x79 };
	unsigned char response[9];
	byte crc = 0;
	int ppm = -1;
	mhtemp_s = 0;

	co2sensor.flush();
	co2sensor.write(cmd, 9);
	memset(response, 0, 9);
	co2sensor.readBytes(response, 9);
	crc = 0;
	for (int myVal = 1; myVal < 8; myVal++) crc += response[myVal];
	crc = 255 - crc;
	crc++;
	if (response[0] == 0xFF && response[1] == 0x86 && response[8] == crc)
	{
		ppm = 256 * (int)response[2] + (int)response[3];
		mhtemp_s = int(response[4]) - 40;
		//Serial.println("PPM: " + String(ppm) + " / CO2: " + String(mhtemp_s));
	}
	/*else
	{
		//Serial.println("CRC error: " + String(crc) + " / " + String(response[8]));
		ppm = -1;
	}*/
	return ppm;
}
#endif

// MH-Z19 CO2 sensor via PPM signal
// PINS: D7 - PPM
#ifdef MH_Z19_PPM_ENABLE
#define MHZ19_PPM 13 //D7
unsigned int co2_ppm_avg[3] = { 0, 0, 0 };

int co2PPMRead(byte pin)
{
	unsigned int th, tl, ppm;
	long timeout = 1000;
	long timer = millis();
	do
	{
		th = pulseIn(pin, HIGH, 1004000) / 1000;
		tl = 1004 - th;
		ppm = 5000 * (th - 2) / (th + tl - 4);
		if (millis() - timer > timeout)
		{
			//Serial.println(F("Failed to read PPM"));
			return -1;
		}
		yield();
	} while (th == 0);
	return ppm;
}
#endif

/* TM1637 display.
TM1637 display leds layout:
		a
		_
	f| |b
		-g
	e|_|c
		d
PINS: D3 - CLK, D4 - DIO
*/
#ifdef TM1637DISPLAY_ENABLE
#include <TM1637Display.h>
#define TM1637_CLK 0 //D3
#define TM1637_DIO 2 //D4
const uint8_t SEG_DEGREE[] = { SEG_A | SEG_B | SEG_F | SEG_G };
const uint8_t SEG_HUMIDITY[] = { SEG_C | SEG_E | SEG_F | SEG_G };
TM1637Display display(TM1637_CLK, TM1637_DIO);
byte displayState = 0;
#endif

// SSD1306 I2C display
// PINS: D1 - SCL, D2 - SDA
#ifdef SSD1306DISPLAY_ENABLE
#include <Wire.h>
#include "SSD1306Ascii.h"
#include "SSD1306AsciiWire.h"
#define I2C_ADDRESS 0x3C
#define RST_PIN -1
const uint8_t * font = fixed_bold10x15;  // 10x15 pix
//const uint8_t* font = cp437font8x8;  // 8*8 pix
//const uint8_t* font = Adafruit5x7;  // 5*7 pix
SSD1306AsciiWire oled;
#endif

#if defined(TM1637DISPLAY_ENABLE) || defined(SSD1306DISPLAY_ENABLE)
unsigned long displaySwitchedLastTime = 0;
unsigned long displaySwitchPeriod = 3000;
#endif

#ifdef ADC_ENABLE
//ADC_MODE(ADC_VCC);

int getAdc()
{
	float averageValue = 0;
	int measurementsToAverage = 16;
	for (int i = 0; i < measurementsToAverage; ++i)
	{
		averageValue += (float)analogRead(A0);
		delay(1);
	}
	averageValue /= measurementsToAverage;
	return int(averageValue);
}
#endif

void setup()
{
	//WiFi.setPhyMode(WIFI_PHY_MODE_11B); //WIFI_PHY_MODE_11B = 1 (60-215mA); WIFI_PHY_MODE_11G = 2 (145mA); WIFI_PHY_MODE_11N = 3 (135mA)
	//WiFi.setOutputPower(); //[0 - 20.5]dBm
	Serial.begin(115200);

	//init EEPROM of certain size
	int eeprom_size = CollectEepromSize();
	EEPROM.begin(eeprom_size + 100);

	//read config from EEPROM (FLASH)
	ssid = readConfigString(SSID_addr, SSID_size);
	wiFiPassword = readConfigString(PASS_addr, PASS_size);
	telnetPort = readConfigString(TELNET_PORT_addr, TELNET_PORT_size).toInt();
	checkSensorPeriod = readConfigString(SENSOR_READ_DELAY_addr, SENSOR_READ_DELAY_size).toInt();
	deviceName = readConfigString(DEVICE_NAME_addr, DEVICE_NAME_size);

	// init WiFi
	WiFi.begin(ssid.c_str(), wiFiPassword.c_str());
	wiFiIntendedStatus = WIFI_CONNECTING;
	Serial.println(F("\r\nConnecting to "));
	Serial.println(ssid);
	unsigned long reconnectTimeStart = millis();
	/*while (WiFi.status() != WL_CONNECTED && millis() - reconnectTimeStart < 5000)
	{
		delay(50);
		if (WiFi.status() == WL_CONNECTED) break;
		yield();
	}*/
	telnetServer.begin(telnetPort);
	telnetServer.setNoDelay(true);

#ifdef SLEEP_ENABLE
	if (readConfigString(ENABLE_SLEEP_addr, ENABLE_SLEEP_size) == SWITCH_ON_NUMBER) sleepEnable = true;
#endif

#ifdef EVENTS_ENABLE
	if (readConfigString(ENABLE_EVENTS_addr, ENABLE_EVENTS_size) == SWITCH_ON_NUMBER) eventsEnable = true;
#endif

#ifdef SCHEDULER_ENABLE
	/*int b = SCHEDULER_TABLE_size / schedulesNumber;
	for (int i = 0; i < schedulesNumber; i++)
	{
		schedulesActions[i] = readConfigString((TELEGRAM_USERS_TABLE_addr + i * b), b);
	}*/
	if (readConfigString(ENABLE_SCHEDULER_addr, ENABLE_SCHEDULER_size) == SWITCH_ON_NUMBER) schedulerEnable = true;
#endif

#ifdef MQTT_ENABLE
	mqtt_server = readConfigString(MQTT_SERVER_addr, MQTT_SERVER_size);
	mqtt_port = readConfigString(MQTT_PORT_addr, MQTT_PORT_size).toInt();
	mqtt_User = readConfigString(MQTT_USER_addr, MQTT_USER_size);
	mqtt_Password = readConfigString(MQTT_PASS_addr, MQTT_PASS_size);
	//mqtt_device_name = readConfigString(MQTT_NAME_addr, MQTT_NAME_size);
	mqtt_topic_in = readConfigString(MQTT_TOPIC_IN_addr, MQTT_TOPIC_IN_size);
	mqtt_topic_out = readConfigString(MQTT_TOPIC_OUT_addr, MQTT_TOPIC_OUT_size);
	if (readConfigString(ENABLE_MQTT_addr, ENABLE_MQTT_size) == SWITCH_ON_NUMBER) mqttEnable = true;

	if (mqttEnable)
	{
		mqtt_client.setServer(mqtt_server.c_str(), mqtt_port);
		mqtt_client.setCallback(mqtt_callback);
		mqtt_client.connect(deviceName.c_str(), mqtt_User.c_str(), mqtt_Password.c_str());
		mqtt_client.subscribe(mqtt_topic_in.c_str());
	}
#endif

#ifdef EMAIL_ENABLE
	smtpServerAddress = readConfigString(SMTP_SERVER_ADDRESS_addr, SMTP_SERVER_ADDRESS_size);
	smtpServerPort = readConfigString(SMTP_SERVER_PORT_addr, SMTP_SERVER_PORT_size).toInt();
	smtpLogin = readConfigString(SMTP_LOGIN_addr, SMTP_LOGIN_size);
	smtpPassword = readConfigString(SMTP_PASSWORD_addr, SMTP_PASSWORD_size);
	smtpTo = readConfigString(SMTP_TO_addr, SMTP_TO_size);
	if (readConfigString(ENABLE_EMAIL_addr, ENABLE_EMAIL_size) == SWITCH_ON_NUMBER) eMailEnable = true;
#endif

#ifdef TELEGRAM_ENABLE
	telegramToken = readConfigString(TELEGRAM_TOKEN_addr, TELEGRAM_TOKEN_size);
	int m = TELEGRAM_USERS_TABLE_size / telegramUsersNumber;
	for (int i = 0; i < telegramUsersNumber; i++)
	{
		telegramUsers[i] = StringToUint64(readConfigString((TELEGRAM_USERS_TABLE_addr + i * m), m));
	}
	if (readConfigString(ENABLE_TELEGRAM_addr, ENABLE_TELEGRAM_size) == SWITCH_ON_NUMBER) telegramEnable = true;
	if (telegramEnable)
	{
		//myBot.wifiConnect(ssid, wiFiPassword);
		myBot.setTelegramToken(telegramToken);
		myBot.testConnection();
	}
#endif

