jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
#ifdef GSCRIPT
	gScriptId = readConfigString(GSCRIPT_ID_addr, GSCRIPT_ID_size);
	if (readConfigString(ENABLE_GSCRIPT_addr, ENABLE_GSCRIPT_size) == SWITCH_ON_NUMBER) gScriptEnable = true;
#endif

#ifdef PUSHINGBOX
	pushingBoxId = readConfigString(PUSHINGBOX_ID_addr, PUSHINGBOX_ID_size);
	pushingBoxParameter = readConfigString(PUSHINGBOX_PARAM_addr, PUSHINGBOX_PARAM_size);
	if (readConfigString(ENABLE_PUSHINGBOX_addr, ENABLE_PUSHINGBOX_size) == SWITCH_ON_NUMBER) pushingBoxEnable = true;
#endif

#ifdef HTTP_SERVER_ENABLE
	httpPort = readConfigString(HTTP_PORT_addr, HTTP_PORT_size).toInt();
	if (readConfigString(ENABLE_HTTP_addr, ENABLE_HTTP_size) == SWITCH_ON_NUMBER) httpServerEnable = true;
	http_server.on("/", handleRoot);
	/*http_server.on("/inline", []()
		{
		http_server.send(200, "text/plain", "this works as well");
		});*/
	http_server.onNotFound(handleNotFound);
	if (httpServerEnable) http_server.begin(httpPort);
#endif

#ifdef NTP_TIME_ENABLE
	timeServer.fromString(readConfigString(NTP_SERVER_addr, NTP_SERVER_size));
	timeZone = readConfigString(NTP_TIME_ZONE_addr, NTP_TIME_ZONE_size).toInt();
	ntpRefreshDelay = readConfigString(NTP_REFRESH_DELAY_addr, NTP_REFRESH_DELAY_size).toInt();
	if (readConfigString(ENABLE_NTP_addr, ENABLE_NTP_size) == SWITCH_ON_NUMBER) NTPenable = true;
	if (NTPenable)
	{
		Udp.begin(localPort);
		setSyncProvider(getNtpTime);
		setSyncInterval(ntpRefreshDelay); //60 sec. = 1 min.
	}
#endif

#ifdef AMS2320_ENABLE
	if (!am2320.begin())
	{
		Serial.println(F("Couldn't find AMS2320 sensor!"));
	}
#endif

#ifdef HTU21D_ENABLE
	if (!htu21d.begin())
	{
		Serial.println(F("Couldn't find HTU21D sensor!"));
	}
#endif

#ifdef BME280_ENABLE
	if (!bme.begin(BME280_ADDRESS))
	{
		Serial.println(F("Couldn't find BME280 sensor!"));
	}
#endif

#ifdef DS18B20_ENABLE
	ds1820.begin();
#endif

#ifdef DHT_ENABLE
	dht.begin();
#endif

#ifdef MH_Z19_UART_ENABLE
	co2sensor.begin(9600);
	co2_uart_avg[0] = co2_uart_avg[1] = co2_uart_avg[2] = co2SerialRead();
#endif

#ifdef MH_Z19_PPM_ENABLE
	pinMode(MHZ19_PPM, INPUT);
	co2_ppm_avg[0] = co2_ppm_avg[1] = co2_ppm_avg[2] = co2PPMRead(MHZ19_PPM);
#endif

#if defined(TM1637DISPLAY_ENABLE) || defined(SSD1306DISPLAY_ENABLE)
	displaySwitchPeriod = readConfigString(DISPLAY_REFRESH_addr, DISPLAY_REFRESH_size).toInt();
#endif

#ifdef TM1637DISPLAY_ENABLE
	display.setBrightness(1);
	display.showNumberDec(0, false);
#endif

#ifdef SSD1306DISPLAY_ENABLE
	Wire.begin();
	Wire.setClock(400000L);
	oled.begin(&Adafruit128x64, I2C_ADDRESS);
	oled.setFont(font);
#endif

	String outStateStr = "";
	outStateStr.reserve(5);
	const String stateOne = F("1");
	const String stateTwo = F("2");
	const String stateThree = F("3");
#ifdef INTERRUPT_COUNTER1_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode1 = RISING;
	else if (outStateStr == stateTwo) intMode1 = FALLING;
	else if (outStateStr == stateThree) intMode1 = CHANGE;
	pinMode(INTERRUPT_COUNTER1_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER1_ENABLE, int1count, intMode1);
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode2 = RISING;
	else if (outStateStr == stateTwo) intMode2 = FALLING;
	else if (outStateStr == stateThree) intMode2 = CHANGE;
	pinMode(INTERRUPT_COUNTER2_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER2_ENABLE, int2count, intMode2);
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode3 = RISING;
	else if (outStateStr == stateTwo) intMode3 = FALLING;
	else if (outStateStr == stateThree) intMode3 = CHANGE;
	pinMode(INTERRUPT_COUNTER3_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER3_ENABLE, int3count, intMode3);
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode4 = RISING;
	else if (outStateStr == stateTwo) intMode4 = FALLING;
	else if (outStateStr == stateThree) intMode4 = CHANGE;
	pinMode(INTERRUPT_COUNTER4_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER4_ENABLE, int4count, intMode4);
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode5 = RISING;
	else if (outStateStr == stateTwo) intMode5 = FALLING;
	else if (outStateStr == stateThree) intMode5 = CHANGE;
	pinMode(INTERRUPT_COUNTER5_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER5_ENABLE, int5count, intMode5);
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode6 = RISING;
	else if (outStateStr == stateTwo) intMode6 = FALLING;
	else if (outStateStr == stateThree) intMode6 = CHANGE;
	pinMode(INTERRUPT_COUNTER6_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER6_ENABLE, int6count, intMode6);
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode7 = RISING;
	else if (outStateStr == stateTwo) intMode7 = FALLING;
	else if (outStateStr == stateThree) intMode7 = CHANGE;
	pinMode(INTERRUPT_COUNTER7_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER7_ENABLE, int7count, intMode7);
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
	outStateStr = readConfigString(INT1_MODE_addr, INT1_MODE_size);
	if (outStateStr == stateOne) intMode8 = RISING;
	else if (outStateStr == stateTwo) intMode8 = FALLING;
	else if (outStateStr == stateThree) intMode8 = CHANGE;
	pinMode(INTERRUPT_COUNTER8_ENABLE, INPUT_PULLUP);
	attachInterrupt(INTERRUPT_COUNTER8_ENABLE, int8count, intMode8);
#endif

#ifdef INPUT1_ENABLE
	pinMode(INPUT1_ENABLE, INPUT_PULLUP);
	in1 = digitalRead(INPUT1_ENABLE);
#endif
#ifdef INPUT2_ENABLE
	pinMode(INPUT2_ENABLE, INPUT_PULLUP);
	in2 = digitalRead(INPUT2_ENABLE);
#endif
#ifdef INPUT3_ENABLE
	pinMode(INPUT3_ENABLE, INPUT_PULLUP);
	in3 = digitalRead(INPUT3_ENABLE);
#endif
#ifdef INPUT4_ENABLE
	pinMode(INPUT4_ENABLE, INPUT_PULLUP);
	in4 = digitalRead(INPUT4_ENABLE);
#endif
#ifdef INPUT5_ENABLE
	pinMode(INPUT5_ENABLE, INPUT_PULLUP);
	in5 = digitalRead(INPUT5_ENABLE);
#endif
#ifdef INPUT6_ENABLE
	pinMode(INPUT6_ENABLE, INPUT_PULLUP);
	in6 = digitalRead(INPUT6_ENABLE);
#endif
#ifdef INPUT7_ENABLE
	pinMode(INPUT7_ENABLE, INPUT_PULLUP);
	in7 = digitalRead(INPUT7_ENABLE);
#endif
#ifdef INPUT8_ENABLE
	pinMode(INPUT8_ENABLE, INPUT_PULLUP);
	in8 = digitalRead(INPUT8_ENABLE);
#endif

#ifdef OUTPUT1_ENABLE
	pinMode(OUTPUT1_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT1_INIT_addr, OUT1_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out1 = (int)OUT_ON;
		digitalWrite(OUTPUT1_ENABLE, out1);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out1 = (int)OUT_OFF;
		digitalWrite(OUTPUT8_ENABLE, out1);
	}
	else
	{
		out1 = outStateStr.toInt();
		analogWrite(OUTPUT1_ENABLE, out1);
	}
#endif
#ifdef OUTPUT2_ENABLE
	pinMode(OUTPUT2_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT2_INIT_addr, OUT2_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out2 = (int)OUT_ON;
		digitalWrite(OUTPUT2_ENABLE, out2);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out2 = (int)OUT_OFF;
		digitalWrite(OUTPUT2_ENABLE, out2);
	}
	else
	{
		out2 = outStateStr.toInt();
		analogWrite(OUTPUT2_ENABLE, out2);
	}
#endif
#ifdef OUTPUT3_ENABLE
	pinMode(OUTPUT3_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT3_INIT_addr, OUT3_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out3 = (int)OUT_ON;
		digitalWrite(OUTPUT3_ENABLE, out3);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out3 = (int)OUT_OFF;
		digitalWrite(OUTPUT3_ENABLE, out3);
	}
	else
	{
		out3 = outStateStr.toInt();
		analogWrite(OUTPUT3_ENABLE, out3);
	}
#endif
#ifdef OUTPUT4_ENABLE
	pinMode(OUTPUT4_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT4_INIT_addr, OUT4_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out4 = (int)OUT_ON;
		digitalWrite(OUTPUT4_ENABLE, out4);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out4 = (int)OUT_OFF;
		digitalWrite(OUTPUT4_ENABLE, out4);
	}
	else
	{
		out4 = outStateStr.toInt();
		analogWrite(OUTPUT4_ENABLE, out4);
	}
#endif
#ifdef OUTPUT5_ENABLE
	pinMode(OUTPUT5_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT5_INIT_addr, OUT5_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out5 = (int)OUT_ON;
		digitalWrite(OUTPUT5_ENABLE, out5);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out5 = (int)OUT_OFF;
		digitalWrite(OUTPUT5_ENABLE, out5);
	}
	else
	{
		out5 = outStateStr.toInt();
		analogWrite(OUTPUT5_ENABLE, out5);
	}
#endif
#ifdef OUTPUT6_ENABLE
	pinMode(OUTPUT6_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT6_INIT_addr, OUT6_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out6 = (int)OUT_ON;
		digitalWrite(OUTPUT6_ENABLE, out6);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out6 = (int)OUT_OFF;
		digitalWrite(OUTPUT6_ENABLE, out6);
	}
	else
	{
		out6 = outStateStr.toInt();
		analogWrite(OUTPUT6_ENABLE, out6);
	}
#endif
#ifdef OUTPUT7_ENABLE
	pinMode(OUTPUT7_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT7_INIT_addr, OUT7_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out7 = (int)OUT_ON;
		digitalWrite(OUTPUT7_ENABLE, out7);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out7 = (int)OUT_OFF;
		digitalWrite(OUTPUT7_ENABLE, out7);
	}
	else
	{
		out7 = outStateStr.toInt();
		analogWrite(OUTPUT7_ENABLE, out7);
	}
#endif
#ifdef OUTPUT8_ENABLE
	pinMode(OUTPUT8_ENABLE, OUTPUT);
	outStateStr = readConfigString(OUT8_INIT_addr, OUT8_INIT_size);
	if (outStateStr == SWITCH_ON)
	{
		out8 = (int)OUT_ON;
		digitalWrite(OUTPUT8_ENABLE, out8);
	}
	else if (outStateStr == SWITCH_OFF)
	{
		out8 = (int)OUT_OFF;
		digitalWrite(OUTPUT8_ENABLE, out8);
	}
	else
	{
		out8 = outStateStr.toInt();
		analogWrite(OUTPUT8_ENABLE, out8);
	}
#endif
	sensor = collectData();
}

void loop()
{
	//check if connection is present and reconnect
	if (wiFiIntendedStatus != WIFI_STOP)
	{
		unsigned long reconnectTimeStart = millis();
		if (wiFiIntendedStatus == WIFI_CONNECTED && WiFi.status() != WL_CONNECTED)
		{
			Serial.println(F("Connection lost."));
			wiFiIntendedStatus = WIFI_CONNECTING;
		}
		if (wiFiIntendedStatus != WIFI_CONNECTED && WiFi.status() == WL_CONNECTED)
		{
			Serial.print(F("Connected to \""));
			Serial.print(String(ssid));
			Serial.println(F("\" AP."));
			Serial.print(F("Use \'telnet "));
			Serial.print(WiFi.localIP());
			Serial.print(F(":"));
			Serial.print(String(telnetPort));
			Serial.println(F("\'"));
			wiFiIntendedStatus = WIFI_CONNECTED;
		}

