jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
#ifdef GSCRIPT
	str += F("GSCRIPT token: \"");
	str += readConfigString(GSCRIPT_ID_addr, GSCRIPT_ID_size);
	str += quote;
	str += eol;
	str += F("GSCRIPT service enabled: ");
	str += readConfigString(ENABLE_GSCRIPT_addr, ENABLE_GSCRIPT_size);
	str += eol;
#endif

#ifdef PUSHINGBOX
	str += F("PUSHINGBOX token: \"");
	str += readConfigString(PUSHINGBOX_ID_addr, PUSHINGBOX_ID_size) + quote;
	str += eol;
	str += F("PUSHINGBOX parameter name: \"");
	str += readConfigString(PUSHINGBOX_PARAM_addr, PUSHINGBOX_PARAM_size);
	str += quote;
	str += eol;
	str += F("PUSHINGBOX service enabled: ");
	str += readConfigString(ENABLE_PUSHINGBOX_addr, ENABLE_PUSHINGBOX_size);
	str += eol;
#endif

#ifdef NTP_TIME_ENABLE
	str += F("NTP server: ");
	str += readConfigString(NTP_SERVER_addr, NTP_SERVER_size);
	str += eol;
	str += F("NTP time zone: ");
	str += readConfigString(NTP_TIME_ZONE_addr, NTP_TIME_ZONE_size);
	str += eol;
	str += F("NTP refresh delay: ");
	str += readConfigString(NTP_REFRESH_DELAY_addr, NTP_REFRESH_DELAY_size);
	str += eol;
	str += F("NTP service enabled: ");
	str += readConfigString(ENABLE_NTP_addr, ENABLE_NTP_size);
	str += eol;
#endif

#ifdef EVENTS_ENABLE
	for (int i = 0; i < eventsNumber; i++)
	{
		str += F("\tEVENT #");
		str += String(i);
		str += F(": \"");
		str += getEvent(i);
		str += quote;
		str += eol;
	}
	str += F("EVENTS service enabled: ");
	str += readConfigString(ENABLE_EVENTS_addr, ENABLE_EVENTS_size);
	str += eol;
#endif

#ifdef SCHEDULER_ENABLE
	for (int i = 0; i < schedulesNumber; i++)
	{
		str += F("\tSCHEDULE #");
		str += String(i);
		str += F(": \"");
		str += getSchedule(i);
		str += quote;
		str += eol;
	}
	str += F("SCHEDULER service enabled: ");
	str += readConfigString(ENABLE_SCHEDULER_addr, ENABLE_SCHEDULER_size);
	str += eol;
#endif

#ifdef SLEEP_ENABLE
	str += F("SLEEP mode enabled: ");
	str += readConfigString(ENABLE_SLEEP_addr, ENABLE_SLEEP_size);
	str += eol;
#endif

#ifdef TM1637DISPLAY_ENABLE	
	str += F("TM1637_CLK on pin ");
	str += String(TM1637_CLK);
	str += eol;
	str += F("TM1637_DIO on pin ");
	str += String(TM1637_DIO);
	str += eol;
#endif

#ifdef SSD1306DISPLAY_ENABLE
	str += F("SSD1306 display on i2c\r\n");
#endif

#if defined(TM1637DISPLAY_ENABLE) || defined(SSD1306DISPLAY_ENABLE)
	str += F("display refresh delay:");
	str += readConfigString(DISPLAY_REFRESH_addr, DISPLAY_REFRESH_size);
	str += eol;
#endif

#ifdef AMS2320_ENABLE
	str += F("AMS2320 on i2c\r\n");
#endif

#ifdef HTU21D_ENABLE
	str += F("HTU21D on i2c\r\n");
#endif

#ifdef BME280_ENABLE
	str += F("BME280 on i2c\r\n");
#endif

#ifdef DS18B20_ENABLE
	str += F("DS18B20 on pin ");
	str += String(ONE_WIRE_PIN);
	str += eol;
#endif

#ifdef DHT_ENABLE
	str += DHTTYPE + " on pin " + String(DHTPIN) + eol;
#endif

#ifdef MH_Z19_UART_ENABLE
	str += F("MH-Z19 CO2 UART sensor:\r\n");
	str += F("TX on pin ");
	str += String(MHZ19_TX);
	str += eol;
	str += F("RX on pin ");
	str += String(MHZ19_RX);
	str += eol;
#endif

#ifdef MH_Z19_PPM_ENABLE
	str += F("MH-Z19 CO2 PPM sensor:\r\n");
	str += F("PPM on pin ");
	str += String(MHZ19_PPM);
	str += eol;
#endif

#ifdef ADC_ENABLE
	str += F("ADC input: A0\r\n");
#endif

#ifdef INTERRUPT_COUNTER1_ENABLE
	str += F("Interrupt1 counter on pin ");
	str += String(INTERRUPT_COUNTER1_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT1_MODE_addr, INT1_MODE_size);
	str += eol;
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
	str += F("Interrupt2 counter on pin ");
	str += String(INTERRUPT_COUNTER2_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT2_MODE_addr, INT2_MODE_size);
	str += eol;
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
	str += F("Interrupt3 counter on pin ");
	str += String(INTERRUPT_COUNTER3_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT3_MODE_addr, INT3_MODE_size);
	str += eol;
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
	str += F("Interrupt4 counter on pin ");
	str += String(INTERRUPT_COUNTER4_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT4_MODE_addr, INT4_MODE_size);
	str += eol;
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
	str += F("Interrupt5 counter on pin ");
	str += String(INTERRUPT_COUNTER5_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT5_MODE_addr, INT5_MODE_size);
	str += eol;
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
	str += F("Interrupt6 counter on pin ");
	str += String(INTERRUPT_COUNTER6_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT6_MODE_addr, INT6_MODE_size);
	str += eol;
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
	str += F("Interrupt7 counter on pin ");
	str += String(INTERRUPT_COUNTER7_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT7_MODE_addr, INT7_MODE_size);
	str += eol;
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
	str += F("Interrupt8 counter on pin ");
	str += String(INTERRUPT_COUNTER8_ENABLE);
	str += eol;
	str += F("\tmode: ");
	str += readConfigString(INT8_MODE_addr, INT8_MODE_size);
	str += eol;
#endif

#ifdef INPUT1_ENABLE
	str += F("Input1 on pin ");
	str += String(INPUT1_ENABLE);
	str += eol;
#endif
#ifdef INPUT2_ENABLE
	str += F("Input2 on pin ");
	str += String(INPUT2_ENABLE);
	str += eol;
#endif
#ifdef INPUT3_ENABLE
	str += F("Input3 on pin ");
	str += String(INPUT3_ENABLE);
	str += eol;
#endif
#ifdef INPUT4_ENABLE
	str += F("Input4 on pin ");
	str += String(INPUT4_ENABLE);
	str += eol;
#endif
#ifdef INPUT5_ENABLE
	str += F("Input5 on pin ");
	str += String(INPUT5_ENABLE);
	str += eol;
#endif
#ifdef INPUT6_ENABLE
	str += F("Input6 on pin ");
	str += String(INPUT6_ENABLE);
	str += eol;
#endif
#ifdef INPUT7_ENABLE
	str += F("Input7 on pin ");
	str += String(INPUT7_ENABLE);
	str += eol;
#endif
#ifdef INPUT8_ENABLE
	str += F("Input8 on pin ");
	str += String(INPUT8_ENABLE);
	str += eol;
#endif

#ifdef OUTPUT1_ENABLE
	str += F("Output1 on pin ");
	str += String(OUTPUT1_ENABLE);
	str += eol;
	str += F("\t initial state: ");
	str += readConfigString(OUT1_INIT_addr, OUT1_INIT_size);
	str += eol;
#endif
#ifdef OUTPUT2_ENABLE
	str += F("Output2 on pin ");
	str += String(OUTPUT2_ENABLE);
	str += eol;
	str += F("\tinitial state: ");
	str += readConfigString(OUT2_INIT_addr, OUT2_INIT_size);
	str += eol;
#endif
#ifdef OUTPUT3_ENABLE
	str += F("Output3 on pin ");
	str += String(OUTPUT3_ENABLE);
	str += eol;
	str += F("\tinitial state: ");
	str += readConfigString(OUT3_INIT_addr, OUT3_INIT_size);
	str += eol;
#endif
#ifdef OUTPUT4_ENABLE
	str += F("Output4 on pin ");
	str += String(OUTPUT4_ENABLE);
	str += eol;
	str += F("\tinitial state: ");
	str += readConfigString(OUT4_INIT_addr, OUT4_INIT_size);
	str += eol;
#endif
#ifdef OUTPUT5_ENABLE
	str += F("Output5 on pin ");
	str += String(OUTPUT5_ENABLE);
	str += eol;
	str += F("\tinitial state: ");
	str += readConfigString(OUT5_INIT_addr, OUT5_INIT_size);
	str += eol;
#endif
#ifdef OUTPUT6_ENABLE
	str += F("Output6 on pin ");
	str += String(OUTPUT6_ENABLE);
	str += eol;
	str += F("\tinitial state: ");
	str += readConfigString(OUT6_INIT_addr, OUT6_INIT_size);
	str += eol;
#endif
#ifdef OUTPUT7_ENABLE
	str += F("Output7 on pin ");
	str += String(OUTPUT7_ENABLE);
	str += eol;
	str += F("\tinitial state: ");
	str += readConfigString(OUT7_INIT_addr, OUT7_INIT_size);
	str += eol;
#endif
#ifdef OUTPUT8_ENABLE
	str += F("Output8 on pin ");
	str += String(OUTPUT8_ENABLE);
	str += eol;
	str += F("\tinitial state: ");
	str += readConfigString(OUT8_INIT_addr, OUT8_INIT_size);
	str += eol;
#endif
	return str;
}

String printStatus()
{
	String str = currentTime();
	str += eol;
	str += F("Time is ");
	if (timeIsSet) str += F("set\r\n");
	else str += F("not set\r\n");

	str += F("WiFi enabled: ");
	str += String(wifiEnable);
	str += eol;
	str += F("Telnet enabled: ");
	str += String(telnetEnable);
	str += eol;

#ifdef NTP_TIME_ENABLE
	str += F("NTP enabled: ");
	str += String(NTPenable);
	str += eol;
#endif

