jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
	if (WiFi.status() == WL_CONNECTED)
	{
		str += F("Connected to \"");
		str += String(ssid);
		str += F("\" access point\r\n");
		str += F("Use: telnet ");
		str += WiFi.localIP().toString();
		str += F(":");
		str += String(telnetPort);
		str += eol;

		int netClientsNum = 0;
		for (int i = 0; i < MAX_SRV_CLIENTS; i++)
		{
			if (serverClient[i] && serverClient[i].connected()) netClientsNum++;
		}
		str += F("Telnet clients connected: ");
		str += String(netClientsNum);
		str += eol;
	}
	else str += F("WiFi not connected\r\n");

#ifdef TELEGRAM_ENABLE
	str += F("TELEGRAM buffer position: ");
	str += String(telegramOutboundBufferPos);
	str += F("/");
	str += String(telegramMessageBufferSize);
	str += eol;
#endif

#ifdef EVENTS_ENABLE
	str += F("Events status:\r\n");
	for (int i = 0; i < eventsNumber; i++)
	{
		String eventStr = getEvent(i);
		if (eventStr.length() > 0)
		{
			str += F("\tEvent #");
			str += String(i);
			str += F(" active: ");
			str += String(eventsFlags[i]);
			str += eol;
	}
}
#endif

	str += F("Log records collected: ");
	str += String(history_record_number);
	str += eol;
	str += F("Free memory: ");
	str += String(ESP.getFreeHeap());
	str += eol;
	return str;
	}

String printHelp()
{
	return F("help\r\n"
		"get_sensor\r\n"
		"get_status\r\n"
		"get_config\r\n"
		"[ADMIN] set_time=yyyy.mm.dd hh:mm:ss\r\n"
		"[ADMIN] autoreport=0/1\r\n"
		"[ADMIN] set_output?=0/1\r\n"

		"[ADMIN][FLASH] set_interrupt_mode?=FALLING/RISING/CHANGE\r\n"
		"[ADMIN][FLASH] set_init_output?=on/off/x\r\n"

		"[ADMIN] getLog = uart/telnet/email/telegram\r\n"

		"[ADMIN][FLASH] check_period=n\r\n"

		"[ADMIN][FLASH] device_name=****\r\n"

		"[ADMIN][FLASH] ssid=****\r\n"
		"[ADMIN][FLASH] wifi_pass=****\r\n"
		"[ADMIN] wifi_enable=1/0\r\n"

		"[ADMIN][FLASH] telnet_port=n\r\n"
		"[ADMIN][FLASH] telnet_enable=1/0\r\n"

		"[ADMIN][FLASH] http_port=n\r\n"
		"[ADMIN][FLASH] http_enable=1/0\r\n"

		"[ADMIN][FLASH] smtp_server=****\r\n"
		"[ADMIN][FLASH] smtp_port=n\r\n"
		"[ADMIN][FLASH] smtp_login=****\r\n"
		"[ADMIN][FLASH] smtp_pass=****\r\n"
		"[ADMIN][FLASH] smtp_to=****@***.***\r\n"
		"[ADMIN][FLASH] smtp_enable=1/0\r\n"

		"[ADMIN][FLASH] mqtt_server=****\r\n"
		"[ADMIN][FLASH] mqtt_port=n\r\n"
		"[ADMIN][FLASH] mqtt_login=****\r\n"
		"[ADMIN][FLASH] mqtt_pass=****\r\n"
		"[ADMIN][FLASH] mqtt_topic_in=****\r\n"
		"[ADMIN][FLASH] mqtt_topic_out=****\r\n"
		"[ADMIN][FLASH] mqtt_enable=1/0\r\n"

		"[ADMIN][FLASH] set_user?=n\r\n"
		"[ADMIN][FLASH] telegram_token=****\r\n"
		"[ADMIN][FLASH] telegram_enable=1/0\r\n"

		"[ADMIN][FLASH] gscript_token=****\r\n"
		"[ADMIN][FLASH] gscript_enable=1/0\r\n"

		"[ADMIN][FLASH] pushingbox_token=****\r\n"
		"[ADMIN][FLASH] pushingbox_parameter=****\r\n"
		"[ADMIN][FLASH] pushingbox_enable=1/0\r\n"

		"[ADMIN][FLASH] ntp_server=***.***.***.***\r\n"
		"[ADMIN][FLASH] ntp_time_zone=n\r\n"
		"[ADMIN][FLASH] ntp_refresh_delay=n\r\n"
		"[ADMIN][FLASH] ntp_enable=1/0\r\n"

		"[ADMIN][FLASH] set_event?=condition:action1;action2\r\n"
		"[ADMIN][FLASH] events_enable=1/0\r\n"

		"[ADMIN][FLASH] set_schedule?=time:action1;action2\r\n"
		"[ADMIN][FLASH] scheduler_enable=1/0\r\n"

		"[ADMIN][FLASH] display_refresh=n\r\n"

		"[ADMIN][FLASH] sleep_enable=1/0\r\n"

		"[ADMIN] reset\r\n");
}

String currentTime()
{
	// digital clock display of the time
	String tmp = String(hour());
	tmp += F(":");
	tmp += String(minute());
	tmp += F(":");
	tmp += String(second());
	tmp += F(" ");
	tmp += String(year());
	tmp += F("/");
	tmp += String(month());
	tmp += F("/");
	tmp += String(day());
	return tmp;
}

sensorDataCollection collectData()
{
	sensorDataCollection sensorData;
	sensorData.year = year();
	sensorData.month = month();
	sensorData.day = day();
	sensorData.hour = hour();
	sensorData.minute = minute();
	sensorData.second = second();

#ifdef AMS2320_ENABLE
	sensorData.ams_humidity = am2320.readHumidity();
	sensorData.ams_temp = am2320.readTemperature();
#endif

#ifdef HTU21D_ENABLE
	sensorData.htu21d_humidity = htu21d.readHumidity();
	sensorData.htu21d_temp = htu21d.readTemperature();
#endif

#ifdef BME280_ENABLE
	sensorData.bme280_humidity = bme.readHumidity();
	sensorData.bme280_temp = bme.readTemperature();
	sensorData.bme280_pressure = bme.readPressure();
#endif

#ifdef DS18B20_ENABLE
	ds1820.requestTemperatures();
	sensorData.ds1820_temp = ds1820.getTempCByIndex(0);
#endif

#ifdef DHT_ENABLE
	sensorData.dht_humidity = dht.readHumidity();
	sensorData.dht_temp = dht.readTemperature();
#endif

#ifdef MH_Z19_UART_ENABLE
	sensorData.mh_uart_co2 = co2SerialRead();
	sensorData.mh_temp = mhtemp_s;
#endif

#ifdef MH_Z19_PPM_ENABLE
	sensorData.mh_ppm_co2 = co2PPMRead(MHZ19_PPM);
#endif

#ifdef ADC_ENABLE
	sensorData.adc = getAdc();
#endif

#ifdef INTERRUPT_COUNTER1_ENABLE
	sensorData.InterruptCounter1 = intCount1;
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
	sensorData.InterruptCounter2 = intCount2;
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
	sensorData.InterruptCounter3 = intCount3;
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
	sensorData.InterruptCounter4 = intCount4;
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
	sensorData.InterruptCounter5 = intCount5;
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
	sensorData.InterruptCounter6 = intCount6;
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
	sensorData.InterruptCounter7 = intCount7;
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
	sensorData.InterruptCounter8 = intCount8;
#endif

#ifdef INPUT1_ENABLE
	sensorData.input1 = in1 = digitalRead(INPUT1_ENABLE);
#endif
#ifdef INPUT2_ENABLE
	sensorData.input2 = in2 = digitalRead(INPUT2_ENABLE);
#endif
#ifdef INPUT3_ENABLE
	sensorData.input3 = in3 = digitalRead(INPUT3_ENABLE);
#endif
#ifdef INPUT4_ENABLE
	sensorData.input4 = in4 = digitalRead(INPUT4_ENABLE);
#endif
#ifdef INPUT5_ENABLE
	sensorData.input5 = in5 = digitalRead(INPUT5_ENABLE);
#endif
#ifdef INPUT6_ENABLE
	sensorData.input6 = in6 = digitalRead(INPUT6_ENABLE);
#endif
#ifdef INPUT7_ENABLE
	sensorData.input7 = in7 = digitalRead(INPUT7_ENABLE);
#endif
#ifdef INPUT8_ENABLE
	sensorData.input8 = in8 = digitalRead(INPUT8_ENABLE);
#endif

#ifdef OUTPUT1_ENABLE
	sensorData.output1 = digitalRead(OUTPUT1_ENABLE);
#endif
#ifdef OUTPUT2_ENABLE
	sensorData.output2 = digitalRead(OUTPUT2_ENABLE);
#endif
#ifdef OUTPUT3_ENABLE
	sensorData.output3 = digitalRead(OUTPUT3_ENABLE);
#endif
#ifdef OUTPUT4_ENABLE
	sensorData.output4 = digitalRead(OUTPUT4_ENABLE);
#endif
#ifdef OUTPUT5_ENABLE
	sensorData.output5 = digitalRead(OUTPUT5_ENABLE);
#endif
#ifdef OUTPUT6_ENABLE
	sensorData.output6 = digitalRead(OUTPUT6_ENABLE);
#endif
#ifdef OUTPUT7_ENABLE
	sensorData.output7 = digitalRead(OUTPUT7_ENABLE);
#endif
#ifdef OUTPUT8_ENABLE
	sensorData.output8 = digitalRead(OUTPUT8_ENABLE);
#endif
	return sensorData;
}

String ParseSensorReport(sensorDataCollection data, String delimiter)
{
	String str = deviceName;
	str += delimiter;
	str += String(data.hour);
	str += F(":");
	str += String(data.minute);
	str += F(":");
	str += String(data.second);
	str += F(" ");
	str += String(data.year);
	str += F("/");
	str += String(data.month);
	str += F("/");
	str += String(data.day);

#ifdef MH_Z19_UART_ENABLE
	str += delimiter;
	str += F("UART CO2=");
	str += String(data.mh_uart_co2);
	str += delimiter;
	str += F("MH-Z19 t=");
	str += String(data.mh_temp);
#endif

#ifdef MH_Z19_PPM_ENABLE
	str += delimiter;
	str += F("PPM CO2=");
	str += String(data.mh_ppm_co2);
#endif

#ifdef AMS2320_ENABLE
	str += delimiter;
	str += F("AMS2320 t=");
	str += String(data.ams_temp);
	str += delimiter;
	str += F("AMS2320 h=");
	str += String(data.ams_humidity);
#endif

