jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
#ifdef HTU21D_ENABLE
	str += delimiter;
	str += F("HTU21D t=");
	str += String(data.htu21d_temp);
	str += delimiter;
	str += F("HTU21D h=");
	str += String(data.htu21d_humidity);
#endif

#ifdef BME280_ENABLE
	str += delimiter;
	str += F("BME280 t=");
	str += String(data.bme280_temp);
	str += delimiter;
	str += F("BME280 h=");
	str += String(data.bme280_humidity);
	str += delimiter;
	str += F("BME280 p=");
	str += String(data.bme280_pressure);
#endif

#ifdef DS18B20_ENABLE
	str += delimiter;
	str += F("DS18B20 t=");
	str += String(data.ds1820_temp);
#endif

#ifdef DHT_ENABLE
	str += delimiter;
	str += DHTTYPE;
	str += F(" t=");
	str += String(data.dht_temp);
	str += delimiter;
	str += DHTTYPE;
	str += F(" h=");
	str += String(data.dht_humidity);
#endif

#ifdef ADC_ENABLE
	str += delimiter;
	str += F("ADC=");
	str += String(data.adc);
#endif

#ifdef INTERRUPT_COUNTER1_ENABLE
	str += delimiter;
	str += F("counter1=");
	str += String(data.InterruptCounter1);
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
	str += delimiter;
	str += F("counter2=");
	str += String(data.InterruptCounter2);
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
	str += delimiter;
	str += F("counter3=");
	str += String(data.InterruptCounter3);
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
	str += delimiter;
	str += F("counter4=");
	str += String(data.InterruptCounter4);
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
	str += delimiter;
	str += F("counter5=");
	str += String(data.InterruptCounter5);
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
	str += delimiter;
	str += F("counter6=");
	str += String(data.InterruptCounter6);
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
	str += delimiter;
	str += F("counter7=");
	str += String(data.InterruptCounter7);
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
	str += delimiter;
	str += F("counter8=");
	str += String(data.InterruptCounter8);
#endif

#ifdef INPUT1_ENABLE
	str += delimiter;
	str += F("IN1=");
	str += String(data.input1);
#endif
#ifdef INPUT2_ENABLE
	str += delimiter;
	str += F("IN2=");
	str += String(data.input2);
#endif
#ifdef INPUT3_ENABLE
	str += delimiter;
	str += F("IN3=");
	str += String(data.input3);
#endif
#ifdef INPUT4_ENABLE
	str += delimiter;
	str += F("IN4=");
	str += String(data.input4);
#endif
#ifdef INPUT5_ENABLE
	str += delimiter;
	str += F("IN5=");
	str += String(data.input5);
#endif
#ifdef INPUT6_ENABLE
	str += delimiter;
	str += F("IN6=");
	str += String(data.input6);
#endif
#ifdef INPUT7_ENABLE
	str += delimiter;
	str += F("IN7=");
	str += String(data.input7);
#endif
#ifdef INPUT8_ENABLE
	str += delimiter;
	str += F("IN8=");
	str += String(data.input8);
#endif

#ifdef OUTPUT1_ENABLE
	str += delimiter;
	str += F("OUT1=");
	str += String(data.output1);
#endif
#ifdef OUTPUT2_ENABLE
	str += delimiter;
	str += F("OUT2=");
	str += String(data.output2);
#endif
#ifdef OUTPUT3_ENABLE
	str += delimiter;
	str += F("OUT3=");
	str += String(data.output3);
#endif
#ifdef OUTPUT4_ENABLE
	str += delimiter;
	str += F("OUT4=");
	str += String(data.output4);
#endif
#ifdef OUTPUT5_ENABLE
	str += delimiter;
	str += F("OUT5=");
	str += String(data.output5);
#endif
#ifdef OUTPUT6_ENABLE
	str += delimiter;
	str += F("OUT6=");
	str += String(data.output6);
#endif
#ifdef OUTPUT7_ENABLE
	str += delimiter;
	str += F("OUT7=");
	str += String(data.output7);
#endif
#ifdef OUTPUT8_ENABLE
	str += delimiter;
	str += F("OUT8=");
	str += String(data.output8);
#endif
	str += delimiter;
	return str;
}

String processCommand(String command, byte channel, bool isAdmin)
{
	String tmp = "";
	if (command.indexOf('=') > 0) tmp = command.substring(0, command.indexOf('=') + 1);
	else tmp = command;
	tmp.toLowerCase();
	String str = "";
	if (tmp == F("get_sensor"))
	{
		sensor = collectData();
		str = ParseSensorReport(sensor, eol);
		str += eol;
	}
	else if (tmp == F("get_status"))
	{
		str = printStatus();
		str += eol;
	}
	else if (tmp == F("get_config"))
	{
		str = currentTime();
		str += eol;
		str += printConfig();
		str += eol;
	}
	else if (tmp == F("help"))
	{
		str = currentTime();
		str += eol;
		str += printHelp();
		str += eol;
	}
	//getLog=uart/telnet/email/telegram
	else if (isAdmin)
	{
		if (tmp.startsWith(F("set_time=")) && command.length() == 28)
		{
			int t = command.indexOf('=');

			int _hr = command.substring(20, 22).toInt();
			int _min = command.substring(23, 25).toInt();
			int _sec = command.substring(26, 28).toInt();
			int _day = command.substring(17, 19).toInt();
			int _month = command.substring(14, 16).toInt();
			int _yr = command.substring(9, 13).toInt();
			setTime(_hr, _min, _sec, _day, _month, _yr);
			str = F("Time set to:");
			str += String(_yr);
			str += F(".");
			str += String(_month);
			str += F(".");
			str += String(_day);
			str += F(" ");
			str += String(_hr);
			str += F(":");
			str += String(_min);
			str += F(":");
			str += String(_sec);
			str += eol;
			timeIsSet = true;
#ifdef NTP_TIME_ENABLE
			NTPenable = false;
#endif

		}
		else if (tmp.startsWith(F("check_period=")) && command.length() > 13)
		{
			checkSensorPeriod = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New sensor check period = \"");
			str += String(checkSensorPeriod);
			str += quote;
			str += eol;
			writeConfigString(SENSOR_READ_DELAY_addr, SENSOR_READ_DELAY_size, String(checkSensorPeriod));
		}
		else if (tmp.startsWith(F("device_name=")) && command.length() > 12)
		{
			deviceName = command.substring(command.indexOf('=') + 1);
			str = F("New device name = \"");
			str += deviceName;
			str += quote;
			str += eol;
			writeConfigString(DEVICE_NAME_addr, DEVICE_NAME_size, deviceName);
		}
		else if (tmp.startsWith(F("ssid=")) && command.length() > 5)
		{
			ssid = command.substring(command.indexOf('=') + 1);
			str = F("New SSID = \"");
			str += ssid;
			str += quote;
			str += eol;
			writeConfigString(SSID_addr, SSID_size, ssid);
			WiFi.begin(ssid.c_str(), wiFiPassword.c_str());
		}
		else if (tmp.startsWith(F("wifi_pass=")) && command.length() > 10)
		{
			wiFiPassword = command.substring(command.indexOf('=') + 1);
			str = F("New password = \"");
			str += wiFiPassword;
			str += quote;
			str += eol;
			writeConfigString(PASS_addr, PASS_size, wiFiPassword);
			WiFi.begin(ssid.c_str(), wiFiPassword.c_str());
		}
		else if (tmp.startsWith(F("wifi_enable=")) && command.length() > 12)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				wifiEnable = false;
				WiFi.mode(WIFI_OFF);
				wiFiIntendedStatus = WIFI_STOP;
				str = F("WiFi disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				wifiEnable = true;
				WiFi.mode(WIFI_STA);
				WiFi.begin(ssid.c_str(), wiFiPassword.c_str());
				wiFiIntendedStatus = WIFI_CONNECTING;
				str = F("WiFi enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += String(stateStr);
				str += eol;
			}
		}

		else if (tmp.startsWith(F("telnet_port=")) && command.length() > 12)
		{
			telnetPort = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New telnet port = \"");
			str += String(telnetPort);
			str += quote;
			str += eol;
			writeConfigString(TELNET_PORT_addr, TELNET_PORT_size, String(telnetPort));
			WiFiServer server(telnetPort);
		}
		else if (tmp.startsWith(F("telnet_enable=")) && command.length() > 14)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				telnetEnable = false;
				telnetServer.stop();
				str = F("Telnet disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				telnetEnable = true;
				telnetServer.begin();
				telnetServer.setNoDelay(true);
				str = F("Telnet enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += String(stateStr);
				str += eol;
			}
		}

		else if (tmp == F("reset"))
		{
#ifdef TELEGRAM_ENABLE
			if (channel == TELEGRAM_CHANNEL)
			{
				if (telegramEnable && WiFi.status() == WL_CONNECTED && myBot.testConnection())
				{
					TBMessage msg;
					while (myBot.getNewMessage(msg))
					{
						yield();
		}
	}
}
#endif
			Serial.println(F("Resetting..."));
			Serial.flush();
			ESP.restart();
		}

		else if (tmp.startsWith(F("autoreport=")) && command.length() > 11)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				autoReport = false;
				str = F("autoreport=off\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				autoReport = true;
				str = F("autoreport=on\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += String(stateStr);
				str += eol;
			}
		}

#if defined(OUTPUT1_ENABLE) || defined(OUTPUT2_ENABLE) || defined(OUTPUT3_ENABLE) || defined(OUTPUT4_ENABLE) || defined(OUTPUT5_ENABLE) || defined(OUTPUT6_ENABLE) || defined(OUTPUT7_ENABLE) || defined(OUTPUT8_ENABLE)
		else if (tmp.startsWith(F("set_init_output")) && command.length() > 17)
		{
			int t = command.indexOf('=');
			if (t >= 16 && t < command.length() - 1)
			{
				byte outNum = command.substring(15, t).toInt();
				String outStateStr = command.substring(t + 1);
				int outState;
				//Serial.println("Out" + String(outNum) + "=" + outStateStr);
				if (outStateStr == SWITCH_ON) outState = OUT_ON;
				else if (outStateStr == SWITCH_OFF) outState = OUT_OFF;
				else
				{
					outState = outStateStr.toInt();
				}
				//Serial.println("InitOut" + String(outNum) + "=" + String(outState));
				const String outTxt1 = F("Output #");
				const String outTxt2 = F(" initial state set to ");
#ifdef OUTPUT1_ENABLE
				if (outNum == 1)
				{
					writeConfigString(OUT1_INIT_addr, OUT1_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
#ifdef OUTPUT2_ENABLE
				if (outNum == 2)
				{
					writeConfigString(OUT2_INIT_addr, OUT2_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
#ifdef OUTPUT3_ENABLE
				if (outNum == 3)
				{
					writeConfigString(OUT3_INIT_addr, OUT3_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
#ifdef OUTPUT4_ENABLE
				if (outNum == 4)
				{
					writeConfigString(OUT4_INIT_addr, OUT4_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
#ifdef OUTPUT5_ENABLE
				if (outNum == 5)
				{
					writeConfigString(OUT5_INIT_addr, OUT5_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
#ifdef OUTPUT6_ENABLE
				if (outNum == 6)
				{
					writeConfigString(OUT6_INIT_addr, OUT6_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
#ifdef OUTPUT7_ENABLE
				if (outNum == 7)
				{
					writeConfigString(OUT7_INIT_addr, OUT7_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
#ifdef OUTPUT8_ENABLE
				if (outNum == 8)
				{
					writeConfigString(OUT8_INIT_addr, OUT8_INIT_size, String(outState));
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += String(outState);
				}
#endif
				if (str.length() == 0)
				{
					str = F("Incorrect output #");
					str += String(outNum);
					str += eol;
				}
			}
			else
			{
				str = F("Incorrect command");
				str += String(command);
				str += eol;
			}
		}

		else if (tmp.startsWith(F("set_output")) && command.length() > 12)
		{
			str = set_output(command);
		}
#endif

#if defined(INTERRUPT_COUNTER1_ENABLE) || defined(INTERRUPT_COUNTER2_ENABLE) || defined(INTERRUPT_COUNTER3_ENABLE) || defined(INTERRUPT_COUNTER4_ENABLE) || defined(INTERRUPT_COUNTER5_ENABLE) || defined(INTERRUPT_COUNTER6_ENABLE) || defined(INTERRUPT_COUNTER7_ENABLE) || defined(INTERRUPT_COUNTER8_ENABLE)
		else if (tmp.startsWith(F("set_interrupt_mode")) && command.length() > 20)
		{
			int t = command.indexOf('=');
			if (t >= 19 && t < command.length() - 1)
			{
				byte outNum = command.substring(18, t).toInt();
				String intMode = command.substring(t + 1);
				//Serial.println("Out" + String(outNum) + "=" + intMode);
				byte intModeNum = 0;
				if (intMode == F("rising")) intModeNum = RISING;
				else if (intMode == F("falling")) intModeNum = FALLING;
				else if (intMode == F("change")) intModeNum = CHANGE;
				else
				{
					str = F("Incorrect value \"");
					str += String(intMode);
					str += quote;
				}
				//Serial.println("InterruptMode" + String(outNum) + "=" + String(intModeNum));
				const String outTxt1 = F("Interrupt #");
				const String outTxt2 = F(" mode: ");
#ifdef INTERRUPT_COUNTER1_ENABLE
				if (outNum == 1)
				{
					intMode1 = intModeNum;
					writeConfigString(INT1_MODE_addr, INT1_MODE_size, String(intMode1));
					attachInterrupt(INTERRUPT_COUNTER1_ENABLE, int1count, intMode1);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
				if (outNum == 2)
				{
					intMode2 = intModeNum;
					writeConfigString(INT2_MODE_addr, INT2_MODE_size, String(intMode2));
					attachInterrupt(INTERRUPT_COUNTER2_ENABLE, int2count, intMode2);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
				if (outNum == 3)
				{
					intMode3 = intModeNum;
					writeConfigString(INT3_MODE_addr, INT3_MODE_size, String(intMode3));
					attachInterrupt(INTERRUPT_COUNTER3_ENABLE, int3count, intMode3);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
				if (outNum == 4)
				{
					intMode4 = intModeNum;
					writeConfigString(INT4_MODE_addr, INT4_MODE_size, String(intMode4));
					attachInterrupt(INTERRUPT_COUNTER4_ENABLE, int4count, intMode4);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
				if (outNum == 5)
				{
					intMode5 = intModeNum;
					writeConfigString(INT5_MODE_addr, INT5_MODE_size, String(intMode5));
					attachInterrupt(INTERRUPT_COUNTER5_ENABLE, int5count, intMode5);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
				if (outNum == 6)
				{
					intMode6 = intModeNum;
					writeConfigString(INT6_MODE_addr, INT6_MODE_size, String(intMode6));
					attachInterrupt(INTERRUPT_COUNTER6_ENABLE, int6count, intMode6);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
				if (outNum == 7)
				{
					intMode7 = intModeNum;
					writeConfigString(INT7_MODE_addr, INT7_MODE_size, String(intMode7));
					attachInterrupt(INTERRUPT_COUNTER7_ENABLE, int7count, intMode7);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
				if (outNum == 8)
				{
					intMode8 = intModeNum;
					writeConfigString(INT8_MODE_addr, INT8_MODE_size, String(intMode8));
					attachInterrupt(INTERRUPT_COUNTER8_ENABLE, int8count, intMode8);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
				if (str.length() == 0)
				{
					str = F("Incorrect interrupt #");
					str += String(outNum);
					str += eol;
				}
			}
			else
			{
				str = F("Incorrect command");
				str += String(command);
				str += eol;
			}
		}
#endif

