jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
#ifdef SLEEP_ENABLE
		else if (tmp.startsWith(F("sleep_enable=")) && command.length() > 13)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				sleepEnable = false;
				writeConfigString(ENABLE_SLEEP_addr, ENABLE_SLEEP_size, SWITCH_OFF_NUMBER);
				str = F("SLEEP mode disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				sleepEnable = true;
				writeConfigString(ENABLE_SLEEP_addr, ENABLE_SLEEP_size, SWITCH_ON_NUMBER);
				str = F("SLEEP mode enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef HTTP_SERVER_ENABLE
		else if (tmp.startsWith(F("http_port=")) && command.length() > 10)
		{
			httpPort = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New HTTP port = \"");
			str += String(httpPort);
			str += quote;
			str += eol;
			writeConfigString(HTTP_PORT_addr, HTTP_PORT_size, String(httpPort));
			if (httpServerEnable) http_server.begin(httpPort);
		}
		else if (tmp.startsWith(F("http_enable=")) && command.length() > 12)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_HTTP_addr, ENABLE_HTTP_size, SWITCH_OFF_NUMBER);
				httpServerEnable = false;
				if (httpServerEnable) http_server.stop();
				str = F("HTTP server disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_HTTP_addr, ENABLE_HTTP_size, SWITCH_ON_NUMBER);
				httpServerEnable = true;
				http_server.on("/", handleRoot);
				http_server.onNotFound(handleNotFound);
				http_server.begin(httpPort);
				str = F("HTTP server enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
		}
			}
#endif

#ifdef MQTT_ENABLE
		/*
	// mqtt_device_name = readConfigString(MQTT_NAME_addr, MQTT_NAME_size);
	mqtt_topic_in = readConfigString(MQTT_TOPIC_IN_addr, MQTT_TOPIC_IN_size);
	mqtt_topic_out = readConfigString(MQTT_TOPIC_OUT_addr, MQTT_TOPIC_OUT_size);
	if (readConfigString(ENABLE_MQTT_addr, ENABLE_MQTT_size) == SWITCH_ON_NUMBER) mqttEnable = true;

	if (mqttEnable)
	{
		mqtt_client.setServer(mqtt_server.c_str(), mqtt_port);
		mqtt_client.setCallback(mqtt_callback);
		mqtt_client.connect(mqtt_device_name.c_str(), mqtt_User.c_str(), mqtt_Password.c_str());
		mqtt_client.subscribe(mqtt_topic_in.c_str());
	}
		*/
		else if (tmp.startsWith(F("mqtt_server=")) && command.length() > 12)
		{
			mqtt_server = command.substring(command.indexOf('=') + 1);
			str = F("New MQTT server address = \"");
			str += mqtt_server;
			str += quote;
			str += eol;
			writeConfigString(MQTT_SERVER_addr, MQTT_SERVER_size, mqtt_server);
			mqtt_client.setServer(mqtt_server.c_str(), mqtt_port);
		}
		else if (tmp.startsWith(F("mqtt_port=")) && command.length() > 10)
		{
			mqtt_port = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New MQTT port = \"");
			str += String(mqtt_port);
			str += quote;
			str += eol;
			writeConfigString(MQTT_PORT_addr, MQTT_PORT_size, String(mqtt_port));
			mqtt_client.setServer(mqtt_server.c_str(), mqtt_port);
		}
		else if (tmp.startsWith(F("mqtt_login=")) && command.length() > 11)
		{
			mqtt_User = command.substring(command.indexOf('=') + 1);
			str = F("New MQTT login = \"");
			str += mqtt_User;
			str += quote;
			str += eol;
			writeConfigString(MQTT_USER_addr, MQTT_USER_size, mqtt_User);
		}
		else if (tmp.startsWith(F("mqtt_pass=")) && command.length() > 10)
		{
			mqtt_Password = command.substring(command.indexOf('=') + 1);
			str = F("New MQTT password = \"");
			str += mqtt_Password;
			str += quote;
			str += eol;
			writeConfigString(MQTT_PASS_addr, MQTT_PASS_size, mqtt_Password);
		}
		else if (tmp.startsWith(F("mqtt_topic_in=")) && command.length() > 8)
		{
			mqtt_topic_in = command.substring(command.indexOf('=') + 1);
			str = F("New MQTT receive topic = \"");
			str += mqtt_topic_in;
			str += quote;
			str += eol;
			writeConfigString(MQTT_TOPIC_IN_addr, MQTT_TOPIC_IN_size, mqtt_topic_in);
		}
		else if (tmp.startsWith(F("mqtt_topic_out=")) && command.length() > 8)
		{
			mqtt_topic_out = command.substring(command.indexOf('=') + 1);
			str = F("New MQTT post topic = \"");
			str += mqtt_topic_out;
			str += quote;
			str += eol;
			writeConfigString(MQTT_TOPIC_OUT_addr, MQTT_TOPIC_OUT_size, mqtt_topic_out);
		}
		else if (tmp.startsWith(F("mqtt_enable=")) && command.length() > 12)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_MQTT_addr, ENABLE_MQTT_size, SWITCH_OFF_NUMBER);
				mqttEnable = false;
				str = F("MQTT disabled\r\n");
				mqtt_client.disconnect();
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_MQTT_addr, ENABLE_MQTT_size, SWITCH_ON_NUMBER);
				mqttEnable = true;
				str = F("MQTT enabled\r\n");
				mqtt_client.setServer(mqtt_server.c_str(), mqtt_port);
				mqtt_client.setCallback(mqtt_callback);
				mqtt_client.connect(deviceName.c_str(), mqtt_User.c_str(), mqtt_Password.c_str());
				mqtt_client.subscribe(mqtt_topic_in.c_str());
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef EMAIL_ENABLE
		// test function
		/*else if (tmp == F("mailme"))
		{
			if (eMailEnable && WiFi.status() == WL_CONNECTED)
			{
				if (history_record_number < 1) str = "No log records";
				bool sendOk = true;
				int n = 0;
				String tmpStr = ParseSensorReport(history_log[n], divider);
				tmpStr += eol;
				n++;
				while (n < history_record_number)
				{
					int freeMem = ESP.getFreeHeap() / 3;
					//Serial.println("***");
					for (; n < (freeMem / tmpStr.length()) - 1; n++)
					{
						if (n >= history_record_number) break;

