jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
						Serial.println("history_record_number=" + String(history_record_number));
						Serial.println("freeMem=" + String(freeMem));
						Serial.println("n=" + String(n));
						//Serial.println("***");

						tmpStr += ParseSensorReport(history_log[n], divider);
						tmpStr += eol;
						yield();
					}
					SendEmail e(smtpServerAddress, smtpServerPort, smtpLogin, smtpPassword, 5000, false);
					sendOk = e.send(smtpLogin, smtpTo, deviceName + " log", tmpStr);
					tmpStr = "";
					yield();
					if (sendOk)
					{
						str = "Log sent to EMail";
						history_record_number = 0;
					}
					else str = "Error sending log to EMail " + String(history_record_number) + " records.";
				}
			}
		}*/
		else if (tmp.startsWith(F("smtp_server=")) && command.length() > 12)
		{
			smtpServerAddress = command.substring(command.indexOf('=') + 1);
			str = F("New SMTP server IP address = \"");
			str += smtpServerAddress;
			str += quote;
			str += eol;
			writeConfigString(SMTP_SERVER_ADDRESS_addr, SMTP_SERVER_ADDRESS_size, smtpServerAddress);
		}
		else if (tmp.startsWith(F("smtp_port=")) && command.length() > 10)
		{
			smtpServerPort = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New SMTP port = \"");
			str += String(smtpServerPort);
			str += quote;
			str += eol;
			writeConfigString(SMTP_SERVER_PORT_addr, SMTP_SERVER_PORT_size, String(smtpServerPort));
			WiFiServer server(telnetPort);
		}
		else if (tmp.startsWith(F("smtp_login=")) && command.length() > 11)
		{
			smtpLogin = command.substring(command.indexOf('=') + 1);
			str = F("New SMTP login = \"");
			str += smtpLogin;
			str += quote;
			str += eol;
			writeConfigString(SMTP_LOGIN_addr, SMTP_LOGIN_size, smtpLogin);
		}
		else if (tmp.startsWith(F("smtp_pass=")) && command.length() > 10)
		{
			smtpPassword = command.substring(command.indexOf('=') + 1);
			str = F("New SMTP password = \"");
			str += smtpPassword;
			str += quote;
			str += eol;
			writeConfigString(SMTP_PASSWORD_addr, SMTP_PASSWORD_size, smtpPassword);
		}
		else if (tmp.startsWith(F("smtp_to=")) && command.length() > 8)
		{
			smtpTo = command.substring(command.indexOf('=') + 1);
			str = F("New SMTP TO address = \"");
			str += smtpTo;
			str += quote;
			str += eol;
			writeConfigString(SMTP_TO_addr, SMTP_TO_size, smtpTo);
		}
		else if (tmp.startsWith(F("smtp_enable=")) && command.length() > 12)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_EMAIL_addr, ENABLE_EMAIL_size, SWITCH_OFF_NUMBER);
				eMailEnable = false;
				str = F("EMail reporting disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_EMAIL_addr, ENABLE_EMAIL_size, SWITCH_ON_NUMBER);
				eMailEnable = true;
				str = F("EMail reporting enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef TELEGRAM_ENABLE
		else if (tmp.startsWith(F("set_user")) && command.length() > 10)
		{
			int t = command.indexOf('=');
			if (t >= 9 && t < command.length() - 1)
			{
				byte userNum = command.substring(8, t).toInt();
				uint64_t newUser = StringToUint64(command.substring(t + 1));
				if (userNum >= 0 && userNum < telegramUsersNumber)
				{
					int m = TELEGRAM_USERS_TABLE_size / telegramUsersNumber;
					writeConfigString(TELEGRAM_USERS_TABLE_addr + userNum * m, m, uint64ToString(newUser));
					telegramUsers[userNum] = newUser;
					str = F("User #");
					str += String(userNum);
					str += F(" is now: ");
					str += uint64ToString(telegramUsers[userNum]);
					str += eol;
				}
				else
				{
					str = F("User #");
					str += String(userNum);
					str += F(" is out of range [0,");
					str += String(telegramUsersNumber - 1);
					str += F("]\r\n");
				}
			}
		}
		else if (tmp.startsWith(F("telegram_token=")) && command.length() > 15)
		{
			telegramToken = command.substring(command.indexOf('=') + 1);
			str = F("New TELEGRAM token = \"");
			str += telegramToken;
			str += quote;
			str += eol;
			writeConfigString(TELEGRAM_TOKEN_addr, TELEGRAM_TOKEN_size, telegramToken);
			myBot.setTelegramToken(telegramToken);
		}
		else if (tmp.startsWith(F("telegram_enable=")) && command.length() > 16)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_TELEGRAM_addr, ENABLE_TELEGRAM_size, SWITCH_OFF_NUMBER);
				telegramEnable = false;
				str = F("Telegram disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_TELEGRAM_addr, ENABLE_TELEGRAM_size, SWITCH_ON_NUMBER);
				telegramEnable = true;
				//myBot.wifiConnect(ssid, wiFiPassword);
				myBot.setTelegramToken(telegramToken);
				//myBot.testConnection();
				str = F("Telegram enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef GSCRIPT
		else if (tmp.startsWith(F("gscript_token=")) && command.length() > 14)
		{
			gScriptId = command.substring(command.indexOf('=') + 1);
			str = F("New GScript token = \"");
			str += gScriptId;
			str += quote;
			str += eol;
			writeConfigString(GSCRIPT_ID_addr, GSCRIPT_ID_size, gScriptId);
		}
		else if (tmp.startsWith(F("gscript_enable=")) && command.length() > 15)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_GSCRIPT_addr, ENABLE_GSCRIPT_size, SWITCH_OFF_NUMBER);
				gScriptEnable = false;
				str = F("GScript disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_GSCRIPT_addr, ENABLE_GSCRIPT_size, SWITCH_ON_NUMBER);
				gScriptEnable = true;
				str = F("GScript enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef PUSHINGBOX
		// test function
		/*else if (tmp == F("pbme"))
		{
			if (pushingBoxEnable && WiFi.status() == WL_CONNECTED)
			{
				sendToPushingBox(printHelp());
			}
		}*/
		else if (tmp.startsWith(F("pushingbox_token=")) && command.length() > 17)
		{
			pushingBoxId = command.substring(command.indexOf('=') + 1);
			str = F("New PushingBox token = \"");
			str += pushingBoxId;
			str += quote;
			str += eol;
			writeConfigString(PUSHINGBOX_ID_addr, PUSHINGBOX_ID_size, pushingBoxId);
		}
		else if (tmp.startsWith(F("pushingbox_parameter=")) && command.length() > 21)
		{
			pushingBoxParameter = command.substring(command.indexOf('=') + 1);
			str = F("New PUSHINGBOX parameter name = \"");
			str += pushingBoxParameter;
			str += quote;
			str += eol;
			writeConfigString(PUSHINGBOX_PARAM_addr, PUSHINGBOX_PARAM_size, pushingBoxParameter);
		}
		else if (tmp.startsWith(F("pushingbox_enable=")) && command.length() > 18)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_PUSHINGBOX_addr, ENABLE_PUSHINGBOX_size, SWITCH_OFF_NUMBER);
				pushingBoxEnable = false;
				str = F("PushingBox disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_PUSHINGBOX_addr, ENABLE_PUSHINGBOX_size, SWITCH_ON_NUMBER);
				pushingBoxEnable = true;
				str = F("PushingBox enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef NTP_TIME_ENABLE
		else if (tmp.startsWith(F("ntp_server=")) && command.length() > 11)
		{
			String tmpSrv = (command.substring(command.indexOf('=') + 1));
			IPAddress tmpAddr;
			if (tmpAddr.fromString(tmpSrv))
			{
				timeServer = tmpAddr;
				str = F("New NTP server = \"");
				str += timeServer.toString();
				str += quote;
				str += eol;
				writeConfigString(NTP_SERVER_addr, NTP_SERVER_size, timeServer.toString());
			}
			else
			{
				str = F("Incorrect NTP server \"");
				str += tmpSrv;
				str += quote;
				str += eol;
			}
		}
		else if (tmp.startsWith(F("ntp_time_zone=")) && command.length() > 14)
		{
			timeZone = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New NTP time zone = \"");
			str += String(timeZone);
			str += quote;
			str += eol;
			writeConfigString(NTP_TIME_ZONE_addr, NTP_TIME_ZONE_size, String(timeZone));
		}
		else if (tmp.startsWith(F("ntp_refresh_delay=")) && command.length() > 18)
		{
			ntpRefreshDelay = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New NTP refresh delay = \"");
			str += String(ntpRefreshDelay);
			str += quote;
			str += eol;
			writeConfigString(NTP_REFRESH_DELAY_addr, NTP_REFRESH_DELAY_size, String(ntpRefreshDelay));
			setSyncInterval(ntpRefreshDelay);
		}
		else if (tmp.startsWith(F("ntp_enable=")) && command.length() > 11)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_NTP_addr, ENABLE_NTP_size, SWITCH_OFF_NUMBER);
				NTPenable = false;
				setSyncProvider(nullptr);
				Udp.stop();
				str = F("NTP disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_NTP_addr, ENABLE_NTP_size, SWITCH_ON_NUMBER);
				NTPenable = true;
				Udp.begin(localPort);
				setSyncProvider(getNtpTime);
				setSyncInterval(ntpRefreshDelay);
				str = F("NTP enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef EVENTS_ENABLE
		else if (tmp.startsWith(F("set_event")) && command.length() > 11)
		{
			int t = command.indexOf('=');
			if (t >= 10 && t < command.length() - 1)
			{
				byte eventNum = command.substring(9, t).toInt();
				String newEvent = command.substring(t + 1);
				if (eventNum >= 0 && eventNum < eventsNumber)
				{
					int m = EVENTS_TABLE_size / eventsNumber;
					writeConfigString(EVENTS_TABLE_addr + eventNum * m, m, newEvent);
					str = F("Event #");
					str += String(eventNum);
					str += F(" is now: ");
					str += newEvent;
					str += eol;
				}
				else
				{
					str = F("Event #");
					str += String(eventNum);
					str += F(" is out of range [0,");
					str += String(eventsNumber - 1);
					str += F("]\r\n");
				}
			}
		}
		else if (tmp.startsWith(F("events_enable=")) && command.length() > 14)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_EVENTS_addr, ENABLE_EVENTS_size, SWITCH_OFF_NUMBER);
				eventsEnable = false;
				str = F("Events disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_EVENTS_addr, ENABLE_EVENTS_size, SWITCH_ON_NUMBER);
				eventsEnable = true;
				str = F("Events enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef SCHEDULER_ENABLE
		else if (tmp.startsWith(F("set_schedule")) && command.length() > 14)
		{
			int t = command.indexOf('=');
			if (t >= 13 && t < command.length() - 1)
			{
				byte scheduleNum = command.substring(12, t).toInt();
				String newSchedule = command.substring(t + 1);
				if (scheduleNum >= 0 && scheduleNum < schedulesNumber)
				{
					int m = SCHEDULER_TABLE_size / schedulesNumber;
					writeConfigString(SCHEDULER_TABLE_addr + scheduleNum * m, m, newSchedule);
					str = F("Schedule #");
					str += String(scheduleNum);
					str += F(" is now: ");
					str += newSchedule;
					str += eol;
				}
				else
				{
					str = F("Schedule #");
					str += String(scheduleNum);
					str += F(" is out of range [0,");
					str += String(schedulesNumber - 1);
					str += F("]\r\n");
				}
			}
		}
		else if (tmp.startsWith(F("scheduler_enable=")) && command.length() > 17)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_SCHEDULER_addr, ENABLE_SCHEDULER_size, SWITCH_OFF_NUMBER);
				schedulerEnable = false;
				str = F("Scheduler disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_SCHEDULER_addr, ENABLE_SCHEDULER_size, SWITCH_ON_NUMBER);
				schedulerEnable = true;
				str = F("Scheduler enabled\r\n");
			}
			else
				str = F("Incorrect value: ");
			str += stateStr;
			str += eol;
		}
#endif

#if defined(TM1637DISPLAY_ENABLE) || defined(SSD1306DISPLAY_ENABLE)
		else if (tmp.startsWith(F("display_refresh=")) && command.length() > 16)
		{
			displaySwitchPeriod = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New display refresh period = \"");
			str += String(displaySwitchPeriod);
			str += quote;
			str += eol;
			writeConfigString(DISPLAY_REFRESH_addr, DISPLAY_REFRESH_size, String(displaySwitchPeriod));
			}
#endif

		else
		{
			str = F("Incorrect command: \"");
			str += command;
			str += quote;
			str += eol;
		}
		}
	else
	{
		str = F("Incorrect command: \"");
		str += command;
		str += quote;
		str += eol;
	}
	return str;
}

