jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_new.c
#ifdef HTU21D_ENABLE
	temp = sensor.htu21d_temp;
#endif

#ifdef AMS2320_ENABLE
	temp = sensor.ams_temp;
#endif

#ifdef DS18B20_ENABLE
	temp = sensor.ds1820_temp;
#endif
	return temp;
}
#endif

#if defined(DHT_ENABLE) || defined(AMS2320_ENABLE) || defined(HTU21D_ENABLE) || defined(BME280_ENABLE)
float getHumidity()
{
	float humidity = -1000;
	//sensor = collectData();
#ifdef DHT_ENABLE
	humidity = sensor.dht_humidity;
#endif

#ifdef AMS2320_ENABLE
	humidity = round(sensor.ams_humidity);
#endif

#ifdef HTU21D_ENABLE
	humidity = sensor.htu21d_humidity;
#endif

#ifdef BME280_ENABLE
	humidity = sensor.bme280_humidity;
#endif

	return humidity;
}
#endif

#if defined(MH_Z19_PPM_ENABLE) || defined(MH_Z19_UART_ENABLE)
int getCo2()
{
	int co2_avg = -1000;
	//sensor = collectData();
#if defined(MH_Z19_PPM_ENABLE)
	if (sensor.mh_ppm_co2 > 0)
	{
		co2_ppm_avg[0] = co2_ppm_avg[1];
		co2_ppm_avg[1] = co2_ppm_avg[2];
		co2_ppm_avg[2] = sensor.mh_ppm_co2;
		co2_avg = (co2_ppm_avg[0] + co2_ppm_avg[1] + co2_ppm_avg[2]) / 3;
	}
#endif

#ifdef MH_Z19_UART_ENABLE
	//Serial.println("Avg CO2: " + String(co2_uart_avg[0]) + " / " + String(co2_uart_avg[1]) + " / " + String(co2_uart_avg[2]));
	//Serial.println("New CO2: " + String(sensor.mh_uart_co2));
	if (sensor.mh_uart_co2 > 0)
	{
		co2_uart_avg[0] = co2_uart_avg[1];
		co2_uart_avg[1] = co2_uart_avg[2];
		co2_uart_avg[2] = sensor.mh_uart_co2;
		co2_avg = (co2_uart_avg[0] + co2_uart_avg[1] + co2_uart_avg[2]) / 3;
	}
#endif

	return co2_avg;
}
#endif

void saveLog(sensorDataCollection record)
{
	history_log[history_record_number] = record;
	history_record_number++;

	//if log is full - shift data back
	if (history_record_number >= LOG_SIZE)
	{
		history_record_number--;
		for (int i = 0; i < LOG_SIZE - 2; i++)
		{
			history_log[i] = history_log[i + 1];
			yield();
		}
	}
}

bool wifiConnect()
{
	WiFi.disconnect(true);
	WiFi.persistent(false);
	WiFi.setPhyMode(WIFI_PHY_MODE_11B); //WIFI_PHY_MODE_11B = 1 (60-215mA); WIFI_PHY_MODE_11G = 2 (145mA); WIFI_PHY_MODE_11N = 3 (135mA)
	WiFi.setOutputPower(20.5); //[0 - 20.5]dBm
	wiFiIntendedStatus = WIFI_CONNECTING;
	WiFi.begin(ssid.c_str(), wiFiPassword.c_str());
	unsigned long reconnectTimeStart = millis();
	while (WiFi.status() != WL_CONNECTED && millis() - reconnectTimeStart < RECONNECT_TIME)
	{
		delay(50);
		if (WiFi.status() == WL_CONNECTED) break;
		Serial.print(F("."));
		yield();
	}
}

/*void StartAPMode()
{
	WiFi.softAPdisconnect(true);
	WiFi.mode(WIFI_OFF);
	delay(1000);
	WiFi.mode(WIFI_AP_STA);
	WiFi.softAP("ESP","12345678");//без пароля
	//WiFi.softAPConfig(apIP, apIPgate, IPAddress(192, 168, 4, 1));//для кастомного ip, работало почему-то не всегда
}*/

/*int countOf(String str, char c)
{
	int count = -1;
	for (int i = 0; i < str.length(); i++)
		if (str[i] == c) count++;
	if (count > -1) count++;
	return count;
}*/
